zephyrproject-rtos/zephyr/drivers/dma/dma_stm32.c
/*
 * Copyright (c) 2016 Linaro Limited.
 * Copyright (c) 2019 Song Qiang <songqiang1304521@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @brief Common part of DMA drivers for stm32.
 * @note  Functions named with stm32_dma_* are SoCs related functions
 *        implemented in dma_stm32_v*.c
 */

#include "dma_stm32.h"

#include <zephyr/init.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/dma/dma_stm32.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

#include <errno.h>
#include <string.h>

static int dma_stm32_hal_map_direction(uint32_t z_dir, uint32_t *hal_dir)
{
	switch (z_dir) {
	case MEMORY_TO_MEMORY:
		*hal_dir = DMA_MEMORY_TO_MEMORY;
		return 0;
	case MEMORY_TO_PERIPHERAL:
		*hal_dir = DMA_MEMORY_TO_PERIPH;
		return 0;
	case PERIPHERAL_TO_MEMORY:
		*hal_dir = DMA_PERIPH_TO_MEMORY;
		return 0;
	default:
		return -ENOTSUP;
	}
}

static int dma_stm32_hal_map_priority(uint32_t z_prio, uint32_t *hal_prio)
{
	switch (z_prio) {
	case 0:
		*hal_prio = DMA_PRIORITY_LOW;
		return 0;
	case 1:
		*hal_prio = DMA_PRIORITY_MEDIUM;
		return 0;
	case 2:
		*hal_prio = DMA_PRIORITY_HIGH;
		return 0;
	case 3:
		*hal_prio = DMA_PRIORITY_VERY_HIGH;
		return 0;
	default:
		return -ENOTSUP;
	}
}

static int dma_stm32_hal_map_data_size(uint32_t z_size, uint32_t *hal_size, uint32_t hal_byte,
				       uint32_t hal_halfword, uint32_t hal_word)
{
	switch (z_size) {
	case 1:
		*hal_size = hal_byte;
		return 0;
	case 2:
		*hal_size = hal_halfword;
		return 0;
	case 4:
		*hal_size = hal_word;
		return 0;
	default:
		return -ENOTSUP;
	}
}

static int dma_stm32_hal_map_mode(const struct dma_config *cfg, uint32_t *hal_mode)
{
	__ASSERT_NO_MSG(cfg != NULL && hal_mode != NULL);

	if (cfg->cyclic) {
#ifdef DMA_CIRCULAR
		*hal_mode = DMA_CIRCULAR;
#else
		return -ENOTSUP;
#endif
	} else {
		*hal_mode = DMA_NORMAL;
	}

	return 0;
}

static int dma_stm32_hal_map_addr_adj(enum dma_addr_adj z_adj, uint32_t *hal_inc,
				      uint32_t hal_inc_val, uint32_t hal_noinc_val)
{
	__ASSERT_NO_MSG(hal_inc != NULL);

	switch (z_adj) {
	case DMA_ADDR_ADJ_INCREMENT:
		*hal_inc = hal_inc_val;
		return 0;
	case DMA_ADDR_ADJ_NO_CHANGE:
		*hal_inc = hal_noinc_val;
		return 0;
	case DMA_ADDR_ADJ_DECREMENT:
		return -ENOTSUP;
	default:
		return -EINVAL;
	}
}

#if defined(DMA_MBURST_SINGLE) || defined(DMA_PBURST_SINGLE)
static int dma_stm32_hal_map_burst(uint32_t z_burst, uint32_t z_size, uint32_t *hal_burst,
				   uint32_t hal_single, uint32_t hal_inc4, uint32_t hal_inc8,
				   uint32_t hal_inc16)
{
	/* A burst length the caller left unset means single transfers */
	if (z_burst == 0 || z_size == 0) {
		*hal_burst = hal_single;
		return 0;
	}

	if (z_burst % z_size != 0) {
		return -ENOTSUP;
	}

	switch (z_burst / z_size) {
	case 1:
		*hal_burst = hal_single;
		return 0;
	case 4:
		*hal_burst = hal_inc4;
		return 0;
	case 8:
		*hal_burst = hal_inc8;
		return 0;
	case 16:
		*hal_burst = hal_inc16;
		return 0;
	default:
		return -ENOTSUP;
	}
}
#endif /* DMA_MBURST_SINGLE || DMA_PBURST_SINGLE */

static int dma_stm32_hal_config_widths(const struct dma_config *cfg, DMA_InitTypeDef *hal_config)
{
	uint32_t periph_dsize, mem_dsize;
	uint32_t periph_burst, mem_burst;
	int ret;

	switch (cfg->channel_direction) {
	case MEMORY_TO_PERIPHERAL:
		periph_dsize = cfg->dest_data_size;
		periph_burst = cfg->dest_burst_length;
		mem_dsize = cfg->source_data_size;
		mem_burst = cfg->source_burst_length;
		break;
	case MEMORY_TO_MEMORY:
		if (cfg->source_data_size != cfg->dest_data_size ||
		    cfg->source_burst_length != cfg->dest_burst_length) {
			return -ENOTSUP;
		}
		__fallthrough;
	case PERIPHERAL_TO_MEMORY:
		periph_dsize = cfg->source_data_size;
		periph_burst = cfg->source_burst_length;
		mem_dsize = cfg->dest_data_size;
		mem_burst = cfg->dest_burst_length;
		break;
	default:
		return -ENOTSUP;
	}

#ifdef DMA_PBURST_SINGLE
	ret = dma_stm32_hal_map_burst(periph_burst, periph_dsize, &hal_config->PeriphBurst,
				      DMA_PBURST_SINGLE, DMA_PBURST_INC4, DMA_PBURST_INC8,
				      DMA_PBURST_INC16);
	if (ret < 0) {
		return ret;
	}
#else
	ARG_UNUSED(periph_burst);
#endif /* DMA_PBURST_SINGLE */

#ifdef DMA_MBURST_SINGLE
	ret = dma_stm32_hal_map_burst(mem_burst, mem_dsize, &hal_config->MemBurst,
				      DMA_MBURST_SINGLE, DMA_MBURST_INC4, DMA_MBURST_INC8,
				      DMA_MBURST_INC16);
	if (ret < 0) {
		return ret;
	}
#else
	ARG_UNUSED(mem_burst);
#endif /* DMA_MBURST_SINGLE */

	ret = dma_stm32_hal_map_data_size(periph_dsize, &hal_config->PeriphDataAlignment,
					  DMA_PDATAALIGN_BYTE, DMA_PDATAALIGN_HALFWORD,
					  DMA_PDATAALIGN_WORD);
	if (ret < 0) {
		return ret;
	}

	return dma_stm32_hal_map_data_size(mem_dsize, &hal_config->MemDataAlignment,
					   DMA_MDATAALIGN_BYTE, DMA_MDATAALIGN_HALFWORD,
					   DMA_MDATAALIGN_WORD);
}

static int dma_stm32_hal_config_increments(uint16_t source_addr_adj, uint16_t dest_addr_adj,
					   uint32_t direction, DMA_InitTypeDef *hal_config)
{
	int ret;
	enum dma_addr_adj periph_adj, mem_adj;

	switch (direction) {
	case MEMORY_TO_PERIPHERAL:
		mem_adj = source_addr_adj;
		periph_adj = dest_addr_adj;
		break;
	case PERIPHERAL_TO_MEMORY:
	case MEMORY_TO_MEMORY:
		mem_adj = dest_addr_adj;
		periph_adj = source_addr_adj;
		break;
	default:
		return -ENOTSUP;
	}

	ret = dma_stm32_hal_map_addr_adj(mem_adj, &hal_config->MemInc, DMA_MINC_ENABLE,
					 DMA_MINC_DISABLE);
	if (ret < 0) {
		return ret;
	}

	return dma_stm32_hal_map_addr_adj(periph_adj, &hal_config->PeriphInc, DMA_PINC_ENABLE,
					  DMA_PINC_DISABLE);
}

/*
 * Default DMA driver configuration relies on these values,
 * in case the fields have not been initialized in the @p zephyr_config.
 *
 * hal_config->Channel			= DMA_CHANNEL_0;
 * hal_config->Direction		= DMA_PERIPH_TO_MEMORY;
 * hal_config->PeriphInc		= DMA_PINC_DISABLE;
 * hal_config->MemInc			= DMA_MINC_DISABLE;
 * hal_config->PeriphDataAlignment	= DMA_PDATAALIGN_BYTE;
 * hal_config->MemDataAlignment		= DMA_MDATAALIGN_BYTE;
 * hal_config->Mode			= DMA_NORMAL;
 * hal_config->Priority			= DMA_PRIORITY_LOW;
 * hal_config->FIFOMode			= DMA_FIFOMODE_DISABLE;
 * hal_config->FIFOThreshold		= DMA_FIFO_THRESHOLD_1QUARTERFULL;
 * hal_config->MemBurst			= DMA_MBURST_SINGLE;
 * hal_config->PeriphBurst		= DMA_PBURST_SINGLE;
 */
int dma_stm32_zcfg_to_halcfg(const struct device *dma, const struct dma_config *zephyr_config,
			     DMA_InitTypeDef *hal_config, uint16_t source_addr_adj,
			     uint16_t dest_addr_adj)
{
	int ret;

