zephyrproject-rtos/zephyr/drivers/dma/dma_stm32.c
	__ASSERT_NO_MSG(dma != NULL && zephyr_config != NULL && hal_config != NULL);

	memset(hal_config, 0, sizeof(*hal_config));

	ret = dma_stm32_hal_map_direction(zephyr_config->channel_direction, &hal_config->Direction);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_map_priority(zephyr_config->channel_priority, &hal_config->Priority);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_config_widths(zephyr_config, hal_config);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_map_mode(zephyr_config, &hal_config->Mode);
	if (ret < 0) {
		return ret;
	}

	ret = dma_stm32_hal_config_increments(source_addr_adj, dest_addr_adj,
					      zephyr_config->channel_direction, hal_config);
	if (ret < 0) {
		return ret;
	}


#if defined(CONFIG_DMA_STM32_V1) && !defined(CONFIG_SOC_SERIES_STM32H7X) && \
	!defined(CONFIG_SOC_SERIES_STM32MP13X)
	hal_config->Channel = zephyr_config->dma_slot;
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32_dma_v2bis)
	/* DMA under "st,stm32-dma-v2bis" compatible do not possess
	 * DMA_InitTypeDef->Channel or DMA_InitTypeDef->Request.
	 */
#else
	hal_config->Request = zephyr_config->dma_slot;
#endif /* CONFIG_DMA_STM32_V1 */

#ifdef DMA_FIFOMODE_DISABLE
	hal_config->FIFOMode = DMA_FIFOMODE_DISABLE;
#endif

#ifdef DMA_FIFO_THRESHOLD_FULL
	hal_config->FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
#endif

	return 0;
}

LOG_MODULE_REGISTER(dma_stm32, CONFIG_DMA_LOG_LEVEL);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_dma_v1)
#define DT_DRV_COMPAT st_stm32_dma_v1
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32_dma_v2)
#define DT_DRV_COMPAT st_stm32_dma_v2
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32_dma_v2bis)
#define DT_DRV_COMPAT st_stm32_dma_v2bis
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(0))
#if DT_INST_IRQ_HAS_IDX(0, 7)
#define DMA_STM32_0_STREAM_COUNT 8
#elif DT_INST_IRQ_HAS_IDX(0, 6)
#define DMA_STM32_0_STREAM_COUNT 7
#elif DT_INST_IRQ_HAS_IDX(0, 5)
#define DMA_STM32_0_STREAM_COUNT 6
#elif DT_INST_IRQ_HAS_IDX(0, 4)
#define DMA_STM32_0_STREAM_COUNT 5
#else
#define DMA_STM32_0_STREAM_COUNT 3
#endif
#endif /* DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(0)) */

#if DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(1))
#if DT_INST_IRQ_HAS_IDX(1, 7)
#define DMA_STM32_1_STREAM_COUNT 8
#elif DT_INST_IRQ_HAS_IDX(1, 6)
#define DMA_STM32_1_STREAM_COUNT 7
#elif DT_INST_IRQ_HAS_IDX(1, 5)
#define DMA_STM32_1_STREAM_COUNT 6
#else
#define DMA_STM32_1_STREAM_COUNT 5
#endif
#endif /* DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(1)) */

static const uint32_t table_m_size[] = {
	LL_DMA_MDATAALIGN_BYTE,
	LL_DMA_MDATAALIGN_HALFWORD,
	LL_DMA_MDATAALIGN_WORD,
};

static const uint32_t table_p_size[] = {
	LL_DMA_PDATAALIGN_BYTE,
	LL_DMA_PDATAALIGN_HALFWORD,
	LL_DMA_PDATAALIGN_WORD,
};

static void dma_stm32_dump_stream_irq(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	stm32_dma_dump_stream_irq(dma, id);
}

static void dma_stm32_clear_stream_irq(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);

	dma_stm32_clear_tc(dma, id);
	dma_stm32_clear_ht(dma, id);
	stm32_dma_clear_stream_irq(dma, id);
}

static void dma_stm32_irq_handler(const struct device *dev, uint32_t id)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);
	struct dma_stm32_stream *stream;
	uint32_t callback_arg;
	int status;

	__ASSERT_NO_MSG(id < config->max_streams);

	stream = &config->streams[id];

	/* The busy channel is pertinent if not overridden by the HAL */
	if ((stream->hal_override != true) && (stream->busy == false)) {
		/*
		 * When DMA channel is not overridden by HAL,
		 * ignore irq if the channel is not busy anymore
		 */
		dma_stm32_clear_stream_irq(dev, id);
		return;
	}
#ifdef CONFIG_DMAMUX_STM32
	callback_arg = stream->mux_channel;
#else
	callback_arg = id + STM32_DMA_STREAM_OFFSET;
#endif /* CONFIG_DMAMUX_STM32 */

	/* The dma stream id is in range from STM32_DMA_STREAM_OFFSET..<dma-requests> */
	if (stm32_dma_is_ht_irq_active(dma, id)) {
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			dma_stm32_clear_ht(dma, id);
		}
		status = DMA_STATUS_BLOCK;
	} else if (stm32_dma_is_tc_irq_active(dma, id)) {
		/* Circular buffer never stops receiving as long as peripheral is enabled */
		if (!stream->cyclic) {
			stream->busy = false;
		}
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			dma_stm32_clear_tc(dma, id);
		}
		status = DMA_STATUS_COMPLETE;
	} else if (stm32_dma_is_unexpected_irq_happened(dma, id)) {
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			LOG_ERR("Unexpected irq happened.");
			stm32_dma_dump_stream_irq(dma, id);
			stm32_dma_clear_stream_irq(dma, id);
		}
		status = -EIO;
	} else {
		/* Let HAL DMA handle flags on its own */
		if (!stream->hal_override) {
			LOG_ERR("Transfer Error.");
			stream->busy = false;
			dma_stm32_dump_stream_irq(dev, id);
			dma_stm32_clear_stream_irq(dev, id);
		}
		status = -EIO;
	}

	if (stream->dma_callback != NULL) {
		stream->dma_callback(dev, stream->user_data, callback_arg, status);
	}
}

#ifdef CONFIG_DMA_STM32_SHARED_IRQS

#define HANDLE_IRQS(index)						       \
	static const struct device *const dev_##index =			       \
		DEVICE_DT_INST_GET(index);				       \
	const struct dma_stm32_config *cfg_##index = dev_##index->config;      \
	DMA_TypeDef *dma_##index = (DMA_TypeDef *)(cfg_##index->base);	       \
									       \
	for (id = 0; id < cfg_##index->max_streams; ++id) {		       \
		if (stm32_dma_is_irq_active(dma_##index, id)) {		       \
			dma_stm32_irq_handler(dev_##index, id);		       \
		}							       \
	}

static void dma_stm32_shared_irq_handler(const struct device *dev)
{
	ARG_UNUSED(dev);
	uint32_t id = 0;

	DT_INST_FOREACH_STATUS_OKAY(HANDLE_IRQS)
}

#endif /* CONFIG_DMA_STM32_SHARED_IRQS */

static int dma_stm32_get_priority(uint8_t priority, uint32_t *ll_priority)
{
	switch (priority) {
	case 0x0:
		*ll_priority = LL_DMA_PRIORITY_LOW;
		break;
	case 0x1:
		*ll_priority = LL_DMA_PRIORITY_MEDIUM;
		break;
	case 0x2:
		*ll_priority = LL_DMA_PRIORITY_HIGH;
		break;
	case 0x3:
		*ll_priority = LL_DMA_PRIORITY_VERYHIGH;
		break;
	default:
		LOG_ERR("Priority error. %d", priority);
		return -EINVAL;
	}

