zephyrproject-rtos/zephyr/drivers/dma/dma_stm32.c
	return 0;
}

static int dma_stm32_init(const struct device *dev)
{
	const struct dma_stm32_config *config = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (clock_control_on(clk,
		(clock_control_subsys_t) &config->pclken) != 0) {
		LOG_ERR("clock op failed\n");
		return -EIO;
	}

	config->config_irq(dev);

	for (uint32_t i = 0; i < config->max_streams; i++) {
		config->streams[i].busy = false;
#ifdef CONFIG_DMAMUX_STM32
		/* Each further stream->mux_channel is fixed here */
		config->streams[i].mux_channel = i + config->offset;
#endif /* CONFIG_DMAMUX_STM32 */
	}

	((struct dma_stm32_data *)dev->data)->dma_ctx.magic = 0;
	((struct dma_stm32_data *)dev->data)->dma_ctx.dma_channels = 0;
	((struct dma_stm32_data *)dev->data)->dma_ctx.atomic = 0;

	return 0;
}

static int dma_stm32_get_status(const struct device *dev,
				uint32_t id, struct dma_status *stat)
{
	const struct dma_stm32_config *config = dev->config;
	DMA_TypeDef *dma = (DMA_TypeDef *)(config->base);
	struct dma_stm32_stream *stream;
	uint32_t pending_elems;

	/* Give channel from index 0 */
	id = id - STM32_DMA_STREAM_OFFSET;
	if (id >= config->max_streams) {
		return -EINVAL;
	}

	stream = &config->streams[id];
	stat->dir = stream->direction;
	stat->busy = stream->busy;

	/*
	 * "Pending length to be transferred in bytes, HW specific"
	 *
	 * The DMA keeps track of a number of elements remaining rather than
	 * an amount of bytes; convert to what the API expects based on the
	 * source data size: "to be transferred" = "to be read from source".
	 */
	pending_elems = LL_DMA_GetDataLength(dma, dma_stm32_id_to_stream(id));
	stat->pending_length = pending_elems * stream->src_size;

	return 0;
}

static DEVICE_API(dma, dma_funcs) = {
	.reload		 = dma_stm32_reload,
	.config		 = dma_stm32_configure,
	.start		 = dma_stm32_start,
	.stop		 = dma_stm32_stop,
	.get_status	 = dma_stm32_get_status,
};

#define DMA_STM32_INIT_DEV(index)						\
	static struct dma_stm32_stream						\
		dma_stm32_streams_##index[DMA_STM32_##index##_STREAM_COUNT];	\
										\
	const struct dma_stm32_config dma_stm32_config_##index = {		\
		.pclken = STM32_DT_INST_CLOCK_INFO(index),			\
		.config_irq = dma_stm32_config_irq_##index,			\
		.base = DT_INST_REG_ADDR(index),				\
		IF_ENABLED(CONFIG_DMA_STM32_V1,					\
			(.support_m2m = DT_INST_PROP(index, st_mem2mem),))	\
		.max_streams = DMA_STM32_##index##_STREAM_COUNT,		\
		.streams = dma_stm32_streams_##index,				\
		IF_ENABLED(CONFIG_DMAMUX_STM32,					\
			(.offset = DT_INST_PROP(index, dma_offset),))		\
	};									\
										\
	static struct dma_stm32_data dma_stm32_data_##index;			\
										\
	DEVICE_DT_INST_DEFINE(index, dma_stm32_init, NULL,			\
			      &dma_stm32_data_##index,				\
			      &dma_stm32_config_##index,			\
			      PRE_KERNEL_1, CONFIG_DMA_INIT_PRIORITY,		\
			      &dma_funcs)

#ifdef CONFIG_DMA_STM32_SHARED_IRQS

#define DMA_STM32_DEFINE_IRQ_HANDLER(dma, chan) /* nothing */

/** Connect and enable IRQ @p chan of DMA instance @p dma */
#define DMA_STM32_IRQ_CONNECT(dma, chan)					\
	do {									\
		IRQ_CONNECT(DT_INST_IRQ_BY_IDX(dma, chan, irq),			\
			    DT_INST_IRQ_BY_IDX(dma, chan, priority),		\
			    dma_stm32_shared_irq_handler,			\
			    DEVICE_DT_INST_GET(dma), 0);			\
		irq_enable(DT_INST_IRQ_BY_IDX(dma, chan, irq));			\
	} while (false)


#else /* CONFIG_DMA_STM32_SHARED_IRQS */

#define DMA_STM32_DEFINE_IRQ_HANDLER(dma, chan)					\
	static void dma_stm32_irq_##dma##_##chan(const struct device *dev)	\
	{									\
		dma_stm32_irq_handler(dev, chan);				\
	}

/**
 * Connect and enable IRQ @p chan of DMA instance @p dma
 *
 * @note Arguments order is reversed for compatibility with LISTIFY!
 */
#define DMA_STM32_IRQ_CONNECT(chan, dma)					\
	do {									\
		IRQ_CONNECT(DT_INST_IRQ_BY_IDX(dma, chan, irq),			\
			    DT_INST_IRQ_BY_IDX(dma, chan, priority),		\
			    dma_stm32_irq_##dma##_##chan,			\
			    DEVICE_DT_INST_GET(dma), 0);			\
		irq_enable(DT_INST_IRQ_BY_IDX(dma, chan, irq));			\
	} while (false)

#endif /* CONFIG_DMA_STM32_SHARED_IRQS */


#if DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(0))

DMA_STM32_DEFINE_IRQ_HANDLER(0, 0);
DMA_STM32_DEFINE_IRQ_HANDLER(0, 1);
DMA_STM32_DEFINE_IRQ_HANDLER(0, 2);
#if DT_INST_IRQ_HAS_IDX(0, 3)
DMA_STM32_DEFINE_IRQ_HANDLER(0, 3);
DMA_STM32_DEFINE_IRQ_HANDLER(0, 4);
#if DT_INST_IRQ_HAS_IDX(0, 5)
DMA_STM32_DEFINE_IRQ_HANDLER(0, 5);
#if DT_INST_IRQ_HAS_IDX(0, 6)
DMA_STM32_DEFINE_IRQ_HANDLER(0, 6);
#if DT_INST_IRQ_HAS_IDX(0, 7)
DMA_STM32_DEFINE_IRQ_HANDLER(0, 7);
#endif /* DT_INST_IRQ_HAS_IDX(0, 3) */
#endif /* DT_INST_IRQ_HAS_IDX(0, 5) */
#endif /* DT_INST_IRQ_HAS_IDX(0, 6) */
#endif /* DT_INST_IRQ_HAS_IDX(0, 7) */

static void dma_stm32_config_irq_0(const struct device *dev)
{
	ARG_UNUSED(dev);

#if !defined(CONFIG_DMA_STM32_SHARED_IRQS)
	/* No shared IRQs: call IRQ_CONNECT for each IRQn in DTS */
	LISTIFY(
		DT_INST_NUM_IRQS(0),
		DMA_STM32_IRQ_CONNECT,
		(;), /* instance: */ 0
	);
#else
	/* All DMAs have at least one IRQ line */
	DMA_STM32_IRQ_CONNECT(0, 0);

	/* On STM32WB0 and STM32WL3 series, there is a single IRQ line
	 * for all channels
	 */
#if !defined(CONFIG_SOC_SERIES_STM32WB0X) && !defined(CONFIG_SOC_SERIES_STM32WL3X)
	/* On other series, the sharing follows a pattern:
	 *	IRQn (X+0) is not shared (assigned to DMA1 channel 1)
	 *	IRQn (X+1) is shared by DMA1 channels 2 and 3
	 *	IRQn (X+2) is shared by DMA1 channels >= 4
	 *
	 * If present, DMA2 channels may also share IRQn (X+1) and (X+2);
	 * this works fine because shared ISR checks all channels of all DMAs.
	 */

	/* Connect IRQ line shared by CH2 and CH3 */
	DMA_STM32_IRQ_CONNECT(0, 1);

	/* If DMA has more than 3 channels, connect IRQ line shared by CH4+ */
#if DT_INST_IRQ_HAS_IDX(0, 3)
	DMA_STM32_IRQ_CONNECT(0, 3);
#endif /* DT_INST_IRQ_HAS_IDX(0, 3) */
#endif /* !CONFIG_SOC_SERIES_STM32WB0X && !CONFIG_SOC_SERIES_STM32WL3X */
#endif /* !CONFIG_DMA_STM32_SHARED_IRQS */
}

DMA_STM32_INIT_DEV(0);

#endif /* DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(0)) */


#if DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(1))

DMA_STM32_DEFINE_IRQ_HANDLER(1, 0);
DMA_STM32_DEFINE_IRQ_HANDLER(1, 1);
DMA_STM32_DEFINE_IRQ_HANDLER(1, 2);
DMA_STM32_DEFINE_IRQ_HANDLER(1, 3);
#if DT_INST_IRQ_HAS_IDX(1, 4)
DMA_STM32_DEFINE_IRQ_HANDLER(1, 4);
#if DT_INST_IRQ_HAS_IDX(1, 5)
DMA_STM32_DEFINE_IRQ_HANDLER(1, 5);
#if DT_INST_IRQ_HAS_IDX(1, 6)
DMA_STM32_DEFINE_IRQ_HANDLER(1, 6);
#if DT_INST_IRQ_HAS_IDX(1, 7)
DMA_STM32_DEFINE_IRQ_HANDLER(1, 7);
#endif /* DT_INST_IRQ_HAS_IDX(1, 4) */
#endif /* DT_INST_IRQ_HAS_IDX(1, 5) */
#endif /* DT_INST_IRQ_HAS_IDX(1, 6) */
#endif /* DT_INST_IRQ_HAS_IDX(1, 7) */

static void dma_stm32_config_irq_1(const struct device *dev)
{
	ARG_UNUSED(dev);

#ifndef CONFIG_DMA_STM32_SHARED_IRQS
	/* No shared IRQs: call IRQ_CONNECT for each IRQn in DTS */
	LISTIFY(
		DT_INST_NUM_IRQS(1),
		DMA_STM32_IRQ_CONNECT,
		(;), /* instance: */ 1
	);
#else
	/**
	 * Series with 2 DMAs and SHARED_IRQS are STM32F0 and STM32G0.
	 * On both of these series, the DMA2 interrupt lines are shared with DMA1,
	 * so they have already been IRQ_CONNECT()'ed and there's nothing to do here.
	 */
#endif /* !CONFIG_DMA_STM32_SHARED_IRQS */
}

DMA_STM32_INIT_DEV(1);

#endif /* DT_NODE_HAS_STATUS_OKAY(DT_DRV_INST(1)) */
